
## Plan Result

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813492335)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_service.ecs_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:761817748648:cluster/go-simple-server"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/go-simple-server:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-041f51729fc1786ce",
            ]
          + subnets          = [
              + "subnet-08f97f54831d3942d",
              + "subnet-0a0c6669630006012",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":13,"Program":"tfcmt","SHA1":"f5e9c852f5c2d227677db14c3b37d8fb05b9558d","Vars":{},"WorkflowName":"Terraform"} -->